from unittest.mock import patch
import pytest
import pandas as pd

from src.utils import get_exchange_rate, stock_prices, get_sum_by_card, get_top_five, greeting_function, read_excel


def test_greeting_function():
    assert greeting_function("2025-02-05 04:30:00") == "Доброй ночи"
    assert greeting_function("2025-02-05 11:10:00") == "Доброе утро"
    assert greeting_function("2025-02-05 12:30:00") == "Добрый день"
    assert greeting_function("2025-02-05 18:30:00") == "Добрый вечер"


@pytest.fixture
def sample_df():
    return pd.DataFrame(
        {"Дата операции": ["28.10.2024 18:25:42",
                           "28.10.2024 18:25:41",
                           "28.10.2024 18:24:55"],
         "Дата платежа": ["28.10.2024",
                          "28.10.2024",
                          "28.10.2024"],
         "Номер карты": ["", "*9916", "*4529"],
         "Статус": ["OK", "OK", "OK"],
         "Сумма операции": [-50000.00, 16968.00, -2450.00],
         "Валюта операции": ["RUB", "RUB", "RUB"],
         "Сумма платежа": [-50000.00, 16968.00, -2450.00],
         "Валюта платежа": ["RUB", "RUB", "RUB"],
         "Кэшбэк": ["", "", ""],
         "Категория": ["Переводы", "Пополнения", "Супермаркеты"],
         "MCC": ["", "5814", "5411"],
         "Описание": ["Перевод между счетами", "Пополнение. Премия", "Людмила П."],
         "Бонусы (включая кэшбэк)": [0, 0, 0],
         "Округление на инвесткопилку": [0, 0, 0],
         "Сумма операции с округлением": [-50000.00, 16968.00, -2450.00]})


@patch("src.utils.pd.read_excel")
def test_read_excel(mock_reader, sample_df, transaction_list) -> None:
    mock_reader.return_value = sample_df
    assert read_excel("test.scv") == transaction_list


@pytest.fixture()
def transactions() -> pd.DataFrame:
    transactions_data = [
        {
            "Дата операции": "20.09.2021 12:45:12",
            "Дата платежа": "20.09.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 200.00,
        },
        {
            "Дата операции": "15.11.2021 01:02:03",
            "Дата платежа": "15.11.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 150.00,
        },
        {
            "Дата операции": "10.12.2021 12:12:12",
            "Дата платежа": "10.12.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 100.00,
        },
        {
            "Дата операции": "22.12.2021 00:00:00",
            "Дата платежа": "22.12.2021",
            "Номер карты": "*7197",
            "Категория": "Другие",
            "Сумма операции с округлением": 50.00,
        },
        {
            "Дата операции": "01.10.2021 12:12:13",
            "Дата платежа": "01.10.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 100.00,
        },
    ]
    transactions_df = pd.DataFrame(transactions_data)
    return transactions_df

def test_get_sum_by_card(transactions: pd.DataFrame):
    assert get_sum_by_card(transactions) == [{"last_digits": "7197", "total_spent": 600.00, "cashback": 6.00}]


@pytest.fixture
def transaction_list():
    return [
        {'MCC': '',
         'Бонусы (включая кэшбэк)': 0,
         'Валюта операции': 'RUB',
         'Валюта платежа': 'RUB',
         'Дата операции': '28.10.2024 18:25:42',
         'Дата платежа': '28.10.2024',
         'Категория': 'Переводы',
         'Кэшбэк': '',
         'Номер карты': '',
         'Округление на инвесткопилку': 0,
         'Описание': 'Перевод между счетами',
         'Статус': 'OK',
         'Сумма операции': -50000.0,
         'Сумма операции с округлением': -50000.0,
         'Сумма платежа': -50000.0},
        {'MCC': '5814',
         'Бонусы (включая кэшбэк)': 0,
         'Валюта операции': 'RUB',
         'Валюта платежа': 'RUB',
         'Дата операции': '28.10.2024 18:25:41',
         'Дата платежа': '28.10.2024',
         'Категория': 'Пополнения',
         'Кэшбэк': '',
         'Номер карты': '*9916',
         'Округление на инвесткопилку': 0,
         'Описание': 'Пополнение. Премия',
         'Статус': 'OK',
         'Сумма операции': 16968.0,
         'Сумма операции с округлением': 16968.0,
         'Сумма платежа': 16968.0},
        {'MCC': '5411',
         'Бонусы (включая кэшбэк)': 0,
         'Валюта операции': 'RUB',
         'Валюта платежа': 'RUB',
         'Дата операции': '28.10.2024 18:24:55',
         'Дата платежа': '28.10.2024',
         'Категория': 'Супермаркеты',
         'Кэшбэк': '',
         'Номер карты': '*4529',
         'Округление на инвесткопилку': 0,
         'Описание': 'Людмила П.',
         'Статус': 'OK',
         'Сумма операции': -2450.0,
         'Сумма операции с округлением': -2450.0,
         'Сумма платежа': -2450.0}]


def test_get_top_five(transaction_list):
    assert get_top_five(transaction_list) == [{'amount': 16968.0,
                                               'category': 'Пополнения',
                                               'date': '28.10.2024',
                                               'description': 'Пополнение. Премия'},
                                              {'amount': -2450.0,
                                               'category': 'Супермаркеты',
                                               'date': '28.10.2024',
                                               'description': 'Людмила П.'},
                                              {'amount': -50000.0,
                                               'category': 'Переводы',
                                               'date': '28.10.2024',
                                               'description': 'Перевод между счетами'}]


@patch("requests.get")
def test_get_exchange_rate(mock_convert) -> None:
    """Проверка вывода суммы в рублях по долларовой транзакции"""
    mock_convert.return_value.status_code = 200
    mock_convert.return_value.json.return_value = {"data": {"RUB": {"value": 1.00}}}
    assert get_exchange_rate() == [{"currency": "USD", "rate": 1.00}, {"currency": "EUR", "rate": 1.00}]


@patch("requests.get")
def test_stock_prices(mock_convert):
    mock_convert.return_value.status_code = 200
    mock_convert.return_value.json.return_value = {"data": [{"symbol": "AAPL", "close": 1.0}]}
    assert stock_prices() == [{"stock": "AAPL", "price": 1.0}]
